#6차 신체치수
dr10<-data.frame(fread("6차_직접측정_2010.csv"))
str(dr10)
dr10_a<-data.frame(fread("3차원_6차_직접측정_2010.csv"))
str(dr10_a)
dr10_b<-data.frame(fread("3차원_6차_형상측정_2010.csv"))
str(dr10_b)

#6차 신체치수 전처리
str(dr10)
str(dr10_a)
str(dr10_b)


#6차직접
dr10_age<- subset(dr10,나이>=14)
#6차직접3d
dr10_a_age<- subset(dr10_a,나이>=14)

#6차형상3d
dr10_b_age<- subset(dr10_b,나이>=14)

#6차직접 전처리- 직접데이터는 사용x
cha6<-dr10_age %>% select("성별","나이","X104.키",
                          "X510.몸무게","X223.어깨사이길이",
                          "X208.가슴둘레","X213.배둘레",
                          "X206.목둘레","X233.팔길이",
                          "X236.겨드랑둘레","X106.목뒤높이",
                          "X111.엉덩이높이","X427.손목둘레",
                          "X428.위팔둘레","X211.허리둘레",
                          "X214.엉덩이둘레","X419.넙다리둘레",
                          "X425.발목최대둘레")

colnames(cha6) <- c("성별","나이","키","몸무게",
                    "어깨가쪽사이길이","가슴둘레",
                    "배둘레","목둘레","팔길이",
                    "겨드랑둘레","목뒤높이",
                    "위앞엉덩뼈가시높이","손목둘레",
                    "편위팔둘레","허리둘레",
                    "엉덩이둘레",
                    "넙다리둘레","발목최대둘레")
str(cha6)
#6차 직접,형상 3d전처리
str(dr10_a_age)
str(dr10_b_age)

test<-merge(dr10_b_age,dr10_a_age,by=c("성별","나이","키"),all=F)
str(test)
sum(is.na(test$몸무게))

cha66<-dr10_b_age %>% select("성별","나이","키",
                             "어깨가쪽사이길이","가슴둘레",
                             "배둘레","목둘레","팔길이",
                             "목뒤높이",
                             "엉덩이높이","손목둘레",
                             "편위팔둘레","허리둘레",
                             "엉덩이둘레",
                             "넙다리둘레","발목최대둘레")
                       
str(cha66)

test2<-merge(cha66,dr10_a_age[,c(1,2,3,13,22)],by=c("성별","나이","키"),all=F)
str(test2)

test22<- test2 %>% select("성별","나이","키","몸무게",
                          "어깨가쪽사이길이","가슴둘레",
                          "배둘레","목둘레","팔길이",
                          "겨드랑둘레","목뒤높이",
                          "엉덩이높이","손목둘레",
                          "편위팔둘레","허리둘레",
                          "엉덩이둘레",
                          "넙다리둘레","발목최대둘레")
str(test22)


colnames(test22)<-c("성별","나이","키","몸무게",
                    "어깨가쪽사이길이","가슴둘레",
                    "배둘레","목둘레","팔길이",
                    "겨드랑둘레","목뒤높이",
                    "위앞엉덩뼈가시높이","손목둘레",
                    "편위팔둘레","허리둘레",
                    "엉덩이둘레",
                    "넙다리둘레","발목최대둘레")

str(cha6)
#데이터병합
version10<- rbind(cha6,test22)

version10$상체총길이<-(version10$목뒤높이-version10$위앞엉덩뼈가시높이)
str(version10)

cha6$상체총길이<-(cha6$목뒤높이-cha6$위앞엉덩뼈가시높이)
str(cha6)
